{
    "ijwwe3": {
        "submission_title": "Jaguars are releasing RB Leonard Fournette, source says.",
        "submission_author": "StrachNasty",
        "submission_upvote_ratio": 0.94,
        "submission_score": 5819,
        "top_comments": [
            "Fournette is about to ruin some of our seasons when he gets signed to our RB1s team.",
            "I feel a great disturbance in the fantasy community. It's as if thousands of voices cried out suddenly \"YOU COULDNT HAVE ANNOUNCED THIS YESTERDAY?\"",
            "Wait what",
            "Chris Thompson is an interesting pick up.. Jags could be playing from behind in a lot of games. This is where CT excels",
            "Wow. So do Thompson or Armstead become super relevant?",
            "I drafted Antonio Brown last year and Fournette this year, AMA.",
            "Thank god I haven’t drafted yet. Fournette was one of my “if he drops far enough” targets.",
            "Is it just me or did this news just crash Sleeper?",
            "so what team is fournette going to and inevitably fuck up the “good situation” for the current RB there?",
            "Wait who do we pickup?? They all kinda suck"
        ],
        "top_comments_scores": [
            1967,
            3110,
            795,
            389,
            317,
            758,
            529,
            262,
            327,
            219
        ]
    },
    "iqoztj": {
        "submission_title": "Clyde Edwards-Helaire played 65% of the snaps last night. He finished with 25 carries for 138 yards and a TD. He had two targets but no catches. Him not converting at the goal line was the only negative. But wait until they unleash him in the passing game",
        "submission_author": "koolman631",
        "submission_upvote_ratio": 0.95,
        "submission_score": 5433,
        "top_comments": [
            "People forget that Hunt had a 65% snap share in 2017 with the Chiefs and he led the league in rushing that year. CEH will likely not perform to that exact same level but he is being used in an almost identical way and will be plenty good for fantasy.",
            "About as good as I could have hoped for. A solid 19.8 in .5 PPR, looks electric. 25 carries, goal line work, 65% of snaps his first ever NFL game with zero preseason...and the chiefs are still the best offense in the league. \n\nPretty pumped",
            "As a Chiefs fan, wonderful game last night. As a CEH owner, I was crying every time he ran into a brick wall at the goal line. The tease was too much.",
            "The issue with the goal line carries were (1) they were uninspired play calls on purpose, there's no need to get fancy with the game secured. If he scored, great. If he didn't, the clock ran. and (2) JJ Watt and the Texans became a completely different defensive front on the goalline selling out against the run every time. Creative play calling would have gotten someone in.",
            "CEH was always going to succeed in this KC offense. Its not like CEH is playing for the Jags. Its almost unfair now that CEH makes the Chiefs offense and all their fantasy players BETTER.",
            "He looked really good last night. Able to shed tackles, quick shifty movement and solid speed to break away with. He also looked patient to make sure his blockers created a lane for him. I definitely don't think it was a fluke",
            "Currently RB1 on the season. Take that CMC.",
            "I had pick number 7 and I debated so much, ended up taking Henry but I already have the feeling I missed a trick here.",
            "[deleted]",
            "I don’t blame it on him for those Goal line stands. Houston D was in the backfield as soon as he took the handoff. No one was getting on those plays. Either way very encouraging to see him get those carries when most people were saying he wouldn’t. I’m excited and glad I took a shot on him this year."
        ],
        "top_comments_scores": [
            1695,
            532,
            682,
            710,
            172,
            49,
            604,
            127,
            27,
            59
        ]
    },
    "iljkgj": {
        "submission_title": "Former Jaguars RB Leonard Fournette is planning to sign with the Bucs, per me and Tom Pelissero. The belief is it will get done.",
        "submission_author": "StrachNasty",
        "submission_upvote_ratio": 0.94,
        "submission_score": 4241,
        "top_comments": [
            "The GM of the Bucs won his home fantasy league in 2017 and decided \"I must make this a real team\"",
            "RONO!",
            "RIP Rojo hype train 2020-2020",
            "Bucs going for that 2017 fantasy football championship",
            "Where do I get my $5?",
            "All fellow Fournette owners bring your asses in here it's time",
            "Where were you when Rojo was kill",
            "Rojo stonks📉",
            "What round we thinking to draft Fournette now?",
            "Thank fuck I couldn’t get Rojo."
        ],
        "top_comments_scores": [
            1971,
            297,
            2062,
            147,
            437,
            1182,
            649,
            347,
            114,
            276
        ]
    },
    "iqxr59": {
        "submission_title": "[Zachariason] Pretty wild that CEH had six goal-line carries last night when Le'Veon Bell had six throughout the entire 2019 season.",
        "submission_author": "Psyduck-Stampede",
        "submission_upvote_ratio": 0.97,
        "submission_score": 4022,
        "top_comments": [
            "Well the Jets only made it to the goal line 6 times in 2019, so thats understandable.",
            "Gase bad",
            "Can you imagine Leveon Bell on the Steelers?",
            "KC has a good coach and NYJ have a bad coach.",
            "Some of his goaline work was situational. They were up big late in the game with no intention of passing for the test if the game. With that said, chiefs will definitely have more of these looks going forward which bodes well for CEH.",
            "This is why you draft RBs on good offenses",
            "I've never heard anyone say one good thing about Gase ever.  How does he still have a job in the NFL?",
            "Why is this guy still a coach",
            "Well being successful at the line eliminates the other attempts.",
            "Le’Veon needs a new team"
        ],
        "top_comments_scores": [
            2149,
            558,
            653,
            323,
            90,
            230,
            73,
            42,
            32,
            42
        ]
    },
    "iowuyo": {
        "submission_title": "Sources: The #AZCardinals are making star WR DeAndre Hopkins the highest paid non-QB ever, giving him a 2-year contract extension worth $54.5M in new money -- $27.25M per year. Hopkins, who did the deal himself, gets $42.75M guaranteed at signing.",
        "submission_author": "mvanigan",
        "submission_upvote_ratio": 0.97,
        "submission_score": 3885,
        "top_comments": [
            "He did the deal himself what a fucking baller",
            "The art of the deal by Deandre Hopkins",
            "Holy shit this man got paid.",
            "Nuk, you will always be one of my favorite players.\n\n- A sad Texans fan",
            "Nuk needs to ride out this contract, retire and become a sports agent.",
            "Wow Nuk got his money  \n  \nEdit: More from Rap  \n>More on DeAndre Hopkins’ agreed upon contract extension with the #AZCardinals: The last year is voidable, which could turn this contract into a 1-year deal worth $39.585M at some point. He got a $27.5M signing bonus, a large sum in a pandemic.",
            "Imagine negotiating with someone who says \"I fear God, boi\".\n\nYou just can't. Well handled, DHop.",
            "I like it. He is my WR1..lets go NUKKK",
            "Yikes, he can buy a lot of things now.",
            "Is any WR worth that money? Especially considering the Cards aren’t really major SB contenders currently?"
        ],
        "top_comments_scores": [
            2779,
            1198,
            543,
            421,
            488,
            162,
            54,
            98,
            75,
            178
        ]
    }
}
